In [1]:
import pandas as pd

In [2]:
lst = [num for num in range(10)]

In [3]:
pd.Series(lst)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [4]:
l = {1: 'one', 2: 'two'}

In [6]:
pd.Series(l)

1    one
2    two
dtype: object

In [7]:
data = [['Bob', 1, 2, 3], ['Bill', 3, 4, 5], ['Sarah', 3, 4, 5], ['Anthony', 3, 4, 8]]

In [8]:
pd.DataFrame(data)

         0  1  2  3
0      Bob  1  2  3
1     Bill  3  4  5
2    Sarah  3  4  5
3  Anthony  3  4  8

In [10]:
pd.DataFrame(data, columns = [1, 2, 3, 4], index = [1, 2, 3, 4])

         1  2  3  4
1      Bob  1  2  3
2     Bill  3  4  5
3    Sarah  3  4  5
4  Anthony  3  4  8

In [13]:
exam_scores = pd.read_csv('exam_scores.csv')

In [15]:
exam_scores

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71
...,...,...,...,...,...,...,...,...
995,female,group C,some high school,standard,none,68,77,72
996,female,group E,some college,standard,none,98,81,94
997,female,group E,associate's degree,free/reduced,none,67,67,67
998,female,group C,high school,standard,none,63,68,70
999,male,group C,some college,free/reduced,none,49,57,50

In [16]:
exam_scores.shape

(1000, 8)

In [18]:
exam_scores.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71

In [19]:
exam_scores.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group C,some high school,standard,none,68,77,72
996,female,group E,some college,standard,none,98,81,94
997,female,group E,associate's degree,free/reduced,none,67,67,67
998,female,group C,high school,standard,none,63,68,70
999,male,group C,some college,free/reduced,none,49,57,50

In [20]:
exam_scores.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [22]:
exam_scores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [24]:
standard = pd.read_csv("https://raw.githubusercontent.com/dphi-official/Datasets/master/Standard_Metropolitan_Areas_Data-data.csv")

In [25]:
standard.shape()

TypeError: 'tuple' object is not callable

In [26]:
standard.shape

(99, 10)

In [27]:
standard.dtypes

land_area           int64
percent_city      float64
percent_senior    float64
physicians          int64
hospital_beds       int64
graduates         float64
work_force        float64
income              int64
region              int64
crime_rate        float64
dtype: object

In [28]:
exam_scores.iloc[0:5]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,standard,none,74,68,67
1,female,group C,some college,standard,completed,58,68,66
2,male,group C,some college,free/reduced,none,66,65,65
3,female,group D,bachelor's degree,free/reduced,none,74,75,73
4,male,group D,some college,standard,none,78,77,71

In [29]:
exam_scores.iloc[[0, 1, 2, 3], 2]

0    bachelor's degree
1         some college
2         some college
3    bachelor's degree
Name: parental level of education, dtype: object

In [30]:
standard.land_area

0     1384
1     3719
2     3553
3     3916
4     2480
      ...
94    1511
95    1543
96    1011
97     813
98     654
Name: land_area, Length: 99, dtype: int64

In [31]:
exam_scores.gender

0        male
1      female
2        male
3      female
4        male
        ...
995    female
996    female
997    female
998    female
999      male
Name: gender, Length: 1000, dtype: object

In [32]:
exam_scores.lunch == 'standard'

0       True
1       True
2      False
3      False
4       True
       ...
995     True
996     True
997    False
998     True
999    False
Name: lunch, Length: 1000, dtype: bool

In [33]:
exam_scores.lunch = 'Food'

In [34]:
exam_scores

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group B,bachelor's degree,Food,none,74,68,67
1,female,group C,some college,Food,completed,58,68,66
2,male,group C,some college,Food,none,66,65,65
3,female,group D,bachelor's degree,Food,none,74,75,73
4,male,group D,some college,Food,none,78,77,71
...,...,...,...,...,...,...,...,...
995,female,group C,some high school,Food,none,68,77,72
996,female,group E,some college,Food,none,98,81,94
997,female,group E,associate's degree,Food,none,67,67,67
998,female,group C,high school,Food,none,63,68,70
999,male,group C,some college,Food,none,49,57,50